package pro.sky.animalshelter.utils;

public class Constants {
    public static String DOG_SHELTER_DESCRIPTION = """
            Приют "Верный друг" - это дом для бездомных собак, где они получают заботу, 
            любовь и второй шанс на счастливую жизнь. Мы стремимся создать комфортные условия 
            и помочь каждой собаке найти свою идеальную семью.\s
            Услуги и забота: В приюте "Верный друг" каждая собака получает все необходимое. 
            Мы предлагаем регулярное питание, медицинское обслуживание, включая прививки и стерилизацию, 
            а также удобные спальные места и просторные загоны, где собаки могут играть и социализироваться.""";

    public static String CAT_SHELTER_DESCRIPTION = """
            Приют "Лапочка" - это уютное и дружелюбное место для кошек. 
            Мы стремимся обеспечить безопасность, заботу и любовь каждому 
            пушистому питомцу, который попадает к нам.\s
            Услуги и забота: В приюте "Лапочка" каждая кошка получает полный спектр услуг 
            и заботы. Мы предлагаем регулярное питание, медицинское обслуживание, 
            включая вакцинацию и стерилизацию, а также уютные спальные места и 
            игровые комнаты, где кошки могут развлекаться и социализироваться.""";

    public final static String SECURITY_CONTACT_INFO = """
            Данные службы охраны для оформления пропуска на машину:
            \uD83D\uDCDE 3534522
            \uD83D\uDCE7 security@dev.pro
            """;

    public static String SHELTER_SCHEDULE = """
            Наши двери открыты для посещения каждый день с 10.00 до 18.00 без выхожных и праздничных дней!""";

    public static String DOG_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения собак можно приносить только специальные собачьи лакомства.
            Ничего соленого, сладкого, жирного, никаких куриных костей!
            3. Угощать собаку через сетку вольера категорически запрещается!
            4. Перед тем, как взять на прогулку новую (незнакомую) собаку, 
            спросите у волонтеров или работников - можно ли с ней гулять.
            5. Если у вас есть свои домашние питомцы и они случайно заболели (инфекция) пожалуйста, 
            воздержитесь от приезда в приют.
            6. Перед началом проведения каких-либо работ, уточните у руководства общий план дел на сегодня, 
            так называемый фронт работ.
            7. Не заходите без опытных сопровождающих в вольеры с незнакомыми собаками!
            Не все собаки милые и дружелюбные, многие выросли на улице и людям не особо доверяют. 
            Или же они могут быть настолько рады вам, что вы не сумеете совладать с этой радостью.
            8. Если вы собираетесь посетить нас впервые - свяжитесь с опытными волонтерами, 
            вас сопроводят и помогут с адаптацией.
            9. Решив взять с собой ребенка, задумайтесь - готов ли ребенок?
            Многие собаки проявляют искреннюю радость при встрече с детьми. Это сопровождается прыжками, 
            покусыванием, бросанием под ноги. Ребенок может просто не устоять на ногах. 
            И не надо забывать, что собаки чувствуют страх!
            10. По территории приюта передвигайтесь спокойно, не бегайте, не машите руками, говорите спокойно.
            Конечно бывают исключения, когда необходимо крикнуть или разнять дерущихся - но это особый пункт.
            11. Если при вас собаки начали драку - не лезьте голыми руками их разнимать!!!! Сразу зовите на помощь!!! 
            Вам помогут либо опытные волонтеры, либо работники. 
            В крайнем случае, возьмите какой-либо инструмент (лопата, метла) и попробуйте им разнять дерущихся!
            12. При первом посещении не трогайте собак, не смотрите в глаза. Спокойно проходите и занимайтесь делами. 
            Когда собаки с вами познакомятся (обнюхают), тогда можно и погладить. """;

    public static String CAT_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения кошек можно приносить только специальные кошачие лакомства.
            Ничего соленого, сладкого, жирного, никаких рыбных костей!
            """;

    public static String PET_HELLO = """
            1. Посещение приюта: Посетите приют, чтобы ознакомиться с животными и узнать о процессе 
            усыновления. Вы можете задать вопросы персоналу приюта и получить информацию о доступных 
            животных.
                        
            2. Изучение информации: Внимательно прочитайте описание животного, его историю, 
            потребности и характеристики. Также узнайте о медицинском состоянии животного и 
            необходимых процедурах, таких как стерилизация или вакцинация.
                        
            3. Взаимодействие с животным: Если позволяют правила приюта, попросите разрешение на 
            взаимодействие с выбранным животным. Обратите внимание на его поведение, реакцию на вас
            и общую совместимость.
                        
            4. Период адаптации: Перед тем, как забрать животное, уточните, какой план адаптации 
            рекомендуется приютом. Узнайте, как предоставить животному комфорт, безопасность и
            постепенно привыкнуть к новому дому.
                        
            5. Ветеринарный осмотр: После того, как вы решите усыновить животное, обязательно 
            запланируйте посещение ветеринара для осмотра и начала необходимых процедур, таких 
            как вакцинация или чипирование.
            """;

    public static String PET_TRANSPORT = """
            1. Используйте безопасный и комфортабельный контейнер: Подготовьте специальный контейнер 
            или переноску для животного, который обеспечит ему безопасность и комфорт во время 
            перевозки. Убедитесь, что контейнер достаточно прочный, имеет достаточное пространство 
            для животного и хорошую вентиляцию.
                        
            2. Подготовьте контейнер заранее: Установите в контейнер мягкое основание, например, 
            покрывало или полотенце, чтобы животное было комфортно. Положите в контейнер игрушку 
            или предмет, с которым оно знакомо, чтобы сделать процесс более расслабленным.
                        
            3. Предоставьте доступ к воде и пище: Убедитесь, что в контейнере есть миска с пресной 
            водой. Если перевозка займет продолжительное время, убедитесь, что животное получит 
            достаточное количество пищи перед началом путешествия. Однако, учитывайте индивидуальные
             особенности животного и следуйте рекомендациям ветеринара.
                        
            4. Соблюдайте температурные условия: Обеспечьте комфортный климат в транспортном 
            средстве. Избегайте экстремальных температур, как холодных, так и жарких.
                        
            5. Обеспечьте безопасность: Убедитесь, что контейнер надежно закрыт и зафиксирован, 
            чтобы избежать возможности побега животного. Постарайтесь избегать резких движений 
            или вибрации транспортного средства, чтобы снизить стресс у животного.
                        
            6. Имейте при себе необходимые документы: Позаботьтесь о наличии всех необходимых 
            документов, таких как паспорт животного, прививочные сертификаты и другие документы,
            которые могут потребоваться при перевозке.
                        
            7. Постоянно следите за животным: Во время перевозки регулярно проверяйте состояние 
            животного. Обратите внимание на его поведение и физическое состояние. Если возникают
             проблемы или замечаете необычное поведение, обратитесь к ветеринару.
            """;

    public static String REFUSE_POLICY = """
            1. Несоответствие требованиям: Приют может иметь определенные требования для 
            потенциальных владельцев, такие как возраст, жилищные условия, наличие забора 
            вокруг участка и т.д. Если вы не соответствуете этим требованиям, приют может 
            отказать в передаче животного.
                        
            2. Неподходящая совместимость: Приют может проводить проверку совместимости между 
            конкретным животным и потенциальным владельцем. Если они считают, что собака не будет
             счастлива или безопасна в вашем доме или с вашим образом жизни, они могут отказать в 
             передаче.
                        
            3. Неполное оформление документов: Если у вас отсутствуют необходимые документы или 
            вы не предоставили все необходимые информации, приют может отказать в передаче животного 
            до тех пор, пока все не будет правильно оформлено.
                        
            4. Неблагоприятный результат проверки: В некоторых случаях приют может проводить 
            проверку потенциальных владельцев, включая домашнюю проверку или общение с предыдущими 
            работниками или ветеринаром. Если результаты проверки вызывают опасения или 
            подозрения, приют может отказать в передаче животного из соображений безопасности .
                        
            5. Ограниченные ресурсы: В некоторых случаях приют может иметь ограниченные 
            ресурсы, включая количество доступных мест или финансовые возможности. Если приют 
            не может обеспечить достаточное количество ухода и внимания для животного, они могут 
            отказать в передаче.
                        
            Важно помнить, что приюты заботятся о благополучии животных и стремятся найти им 
            надежные и любящие дома. Если у вас отказали в передаче собаки, обратитесь к приюту 
            или специалистам по усыновлению, чтобы получить дополнительную информацию о причинах 
            отказа и возможных вариантах.
            """;

    public static String HOW_TO_HELLO_DOG = """
            1. Будьте спокойны и уверены: Собаки могут чувствовать ваше состояние и эмоции, поэтому 
            важно быть спокойным и уверенным во время общения. Постарайтесь избегать нервозности 
            или напряжения, так как это может вызывать беспокойство у собаки.
                        
            2. Установите правила и границы: Собаки нуждаются в структуре и понимании правил. 
            Установите ясные правила и границы с самого начала, чтобы собака понимала, что можно 
            и нельзя делать. Будьте последовательными и награждайте положительное поведение.
                        
            3. Используйте положительное обучение: Положительное обучение, основанное на поощрении 
            и похвале, является наиболее эффективным способом обучения собак. Используйте 
            вознаграждения в виде лакомств, похвалы и игры для поощрения желаемого поведения.
                        
            4. Установите контакт глазами: Установление контакта глазами с собакой может помочь в
             установлении связи и доверия. Но будьте осторожны, особенно с незнакомыми собаками, 
             и не пристально смотрите в их глаза, так как это может восприниматься как угроза.
                        
            5. Не навязывайте физический контакт: Некоторые собаки могут быть неуверенными или не 
            любить физический контакт с незнакомыми людьми. Уважайте их границы и не навязывайте 
            обнимания или поцелуи. Позвольте им самим подойти к вам и инициировать физическое 
            общение.
                        
            6. Изучайте язык тела собаки: Изучите основные сигналы и язык тела собаки, чтобы лучше 
            понимать ее настроение и потребности. Например, хвост, уши, поза тела и мимика могут 
            дать вам подсказку о том, комфортна ли собака или нет.
                        
            7. Будьте терпеливыми и дайте время: Каждая собака уникальна и может требовать свое 
            время для адаптации и установления доверия. Будьте терпеливыми и дайте собаке время 
            на осмотр и изучение новой среды.
            """;
    public static String KITTEN_ADVICE = """
            Советы по содержанию котят:
            1. Питание: Обеспечьте котятам сбалансированное и качественное питание, соответствующее их возрасту и 
            потребностям. Выберите специальный корм для котят, который содержит необходимые питательные вещества. 
            Постепенно переходите на сухой корм, но также предоставляйте им доступ к свежей воде.
            2. Режим и тренировка: Установите регулярный режим дня для котят, включая время для сна, еды, игры и 
            обучения. Начинайте тренировку с основных команд и стимулируйте их игрушками. Помогите им освоиться в 
            новом доме и учиться использовать лоток для нужд.
            3. Социализация: Важно социализировать котят, предоставляя им возможность встречаться с другими животными, 
            людьми и различными ситуациями. Постепенно представляйте им новые окружения и стимулы, чтобы они развивали 
            уверенность и адаптировались к новым ситуациям.
            4. Здоровье и ветеринарный уход: Профилактически обследуйте котят у ветеринара, следите за их вакцинацией, 
            обработкой от паразитов и другими необходимыми процедурами. Регулярно чистите ушки и зубы котят. 
            Обратитесь к ветеринару, если замечаете какие-либо изменения в их поведении или состоянии здоровья.
            5. Игры и физическая активность: Котята нуждаются в достаточной физической активности для развития 
            мышц и здоровья. Предоставляйте им игрушки, которые стимулируют их охотничий инстинкт, и регулярно 
            играйте с ними. Создайте для них место для лазания и прыжков, чтобы они могли развивать свои навыки 
            и энергию.
            6. Любовь и внимание: Котята нуждаются в любви, заботе и внимании. Уделяйте им время для игр, общения и 
            ласк. Создайте прочную эмоциональную связь с котятами и укрепляйте их доверие и дружбу.
            7. Безопасность: Обеспечьте безопасность котят в вашем доме. Удалите опасные предметы, обезопасьте 
            электрические провода и убедитесь, что они не могут попасть в опасные места, такие как стиральные машины 
            или открытые окна. Осмотрите растения, чтобы убедиться, что они не являются ядовитыми для котят.
            Каждое котенок уникально, и может потребоваться индивидуальный подход и дополнительные советы от 
            ветеринара или специалиста по поведению. Следуйте этим общим рекомендациям, и у вас будет здоровый, 
            счастливый и хорошо воспитанный питомец!
            """;
    public static String PUPPY_ADVICE = """
            Советы по содержанию щенков:
             1. Питание: Обеспечьте щенку сбалансированное и качественное питание, соответствующее его возрасту и 
             породе. Обратитесь к ветеринару для рекомендаций по рациону и количеству приемов пищи в день. Убедитесь, 
             что щенок имеет постоянный доступ к свежей воде.        
             2. Режим и тренировка: Установите регулярный режим дня для щенка, включающий время для сна, еды, игры, 
             прогулок и тренировок. Начинайте тренировку с основных команд и социализации с другими собаками и людьми. 
             Постепенно увеличивайте сложность тренировок и варьируйте их, чтобы поддерживать интерес щенка.
             3. Социализация: Важно социализировать щенка, предоставляя ему возможность встречаться с другими собаками, 
             людьми и различными ситуациями. Введение щенка в различные окружения и стимулы поможет ему развивать 
             уверенность и адаптироваться к новым ситуациям.
             4. Здоровье и ветеринарный уход: Помните о регулярных посещениях ветеринара для обследования щенка, 
             вакцинации и профилактического лечения от паразитов. Поддерживайте гигиену щенка, регулярно чистите 
             его уши, зубы и обрезайте когти.
             5. Физическая активность: Щенки нуждаются в достаточной физической активности для развития мышц, 
             поддержки здоровья и снятия лишней энергии. Предоставьте щенку возможность играть, бегать и заниматься 
             физическими упражнениями каждый день. Однако помните, что слишком интенсивная физическая активность может 
             быть вредной для растущего организма, поэтому консультируйтесь с ветеринаром относительно оптимального 
             уровня активности для вашего щенка.
             6. Любовь и внимание: Щенки нуждаются в любви, заботе и внимании. Предоставляйте щенку достаточно 
             времени для игр, общения и просто обнимашек. Создайте прочную эмоциональную связь с щенком и укрепляйте 
             его доверие и дружбу.
             7. Безопасность: Обеспечьте безопасность щенка в вашем доме. Удалите опасные предметы, убедитесь, что 
             есть надежные ограждения и препятствия для предотвращения попадания щенка на улицу или в опасные места. 
             Обратите внимание на домашние растения и химические вещества, которые могут быть опасными для щенка.
             Каждый щенок уникален, поэтому возможно потребуется индивидуальный подход и дополнительные советы от 
             ветеринара или кинолога. Следуйте этим общим рекомендациям, и у вас будет здоровый, счастливый и хорошо 
             воспитанный питомец!
            """;

    public static String ADULT_DOG = """
            Советы по адаптации содержанию взрослой собаки:
             1.  У собаки должно быть место, где она сможет чувствовать себя в полной безопасности. 
             Лежанку для взрослого питомца лучше разместить в укромном уголке. 
             Без необходимости не трогайте собаку. Не беспокойте ее, когда она отдыхает на своем месте. 
             Помните, что свое место должно служить для питомца гарантом безопасности и покоя. У него так же, 
             как и у вас, должно быть свое личное пространство.       
             2. Незнакомая ситуация будет стрессом для собаки. К звукам и запахам нового дома она привыкнет не сразу. 
             Отключите звук домофона, поставьте телефоны на беззвучный режим, чтобы новосел первое время слышал как 
             можно меньше резких громких звуков.
             3. Первые десять дней кормите питомца так же, как его кормили в приюте. Потом постепенно переводите его 
             на рацион, рекомендованный ветеринарным специалистом. Пища должна нравиться питомцу и легко усваиваться, 
             ведь стресс заметно сказывается и на системе пищеварения. Наблюдайте за реакцией организма питомца на пищу, 
             очень важно наладить работу ЖКТ.
             Если прежние хозяева держали собаку на голодном пайке, она может начать ревностно охранять от вас свою еду. 
             Попробуйте отстраниться, отвернуться, всем своим видом показать, что не помешаете насладиться трапезой. 
             Потом можете начать проходить мимо, подкидывая в миску лакомство. Так собака поймет, что вы не только не 
             отнимите еду, но и предложите еще что-нибудь вкусное.
             4. Первые два месяца адаптации собаки из приюта в новом доме сопряжены с наибольшими трудностями. 
             Зоопсихологи настоятельно рекомендуют хозяевам брать отпуск хотя бы на первые две-три недели пребывания в 
             доме нового питомца. Именно в это время вам нужно подружиться, познакомиться, начать вместе прорабатывать 
             страхи собаки. Помните, что появление собаки в вашем доме сродни появлению у вас 5-летнего ребенка!
             Собака, которую уже однажды бросили, обычно испытывает нехватку общения, внимания, ласки.
             5. Первые два месяца не следует навязчиво обучать питомца командам. В это время основная цель прогулок — 
             научить собаку идти на провисшем поводке и взаимодействовать с вами. Вся амуниция для питомца, проходящего 
             период адаптации, должна быть максимально удобной. Чем меньше амуниции вы наденете на питомца, тем лучше. 
             Покажите, что не будете без нужды стеснять его движения. Подумайте об умеренности физических нагрузок 
             для собаки. Лучше гулять понемногу, но часто, чем утомить четвероногого друга ненужным марш-броском через 
             весь район. Обязательно оставляйте для питомца возможность выбора, если это не противоречит правилам 
             безопасности. Хочет погулять подольше? Хорошая идея. Не нравится игрушка? Без проблем, уберем эту игрушку, 
             играй с той, которая нравится. Среди собак из приюта есть те, кто пережил дрессировку с использованием 
             негуманных методов. Они становятся не тренируемыми. Однако они вполне понимают, когда нужно встать, сесть, 
             подойти к хозяину. Если вы беспокоитесь, что не сможете самостоятельно помочь питомцу преодолеть 
             последствия психологических травм и стресса, обратитесь к зоопсихологу и расскажите специалисту как можно 
             подробнее о вашей собаке и сложностях в общении с ней.
             
             К периоду адаптации собаки в новой семье следует отнестись с большим вниманием. Это время, когда вы 
             закладываете фундамент взаимного доверия и дружбы. Если вы научитесь считывать настроение, психологическое 
             состояние вашей собаки, выстроить добрые отношения с домашним любимцем будет гораздо проще. 
             Питомец непременно оценит вашу заботу и станет верным другом на долгие годы.
            """;

    public static String ADULT_CAT = """
            Советы по адаптации содержанию взрослой кошки:
             1.  По проходу домой поставьте переноску в комнату и откройте её. Там заранее должны стоять лоток, 
             миски с едой и водой, игрушки. Оставьте кошку, пусть освоится и все обнюхает.Через пару часов зайдите в 
             комнату, не обращая на нее внимания. Так она поймёт, что ей ничего не угрожает. Не торопите события, 
             питомец выйдет из комнаты, когда будет готов. Предупредите близких, чтобы они не трогали кошку.      
             2. Итак, кошка знает, где её лоток и еда. Теперь нужны зрелища. Возьмите обыкновенную верёвочку и водите 
             ею недалеко от кошки. Кошка не устоит и начнёт играть. Так, играя, можно обойти все комнаты. 
             А в завершении — угощение. Просто положите его поодаль. Постепенно, играя и угощая, вы приручите 
             кошку к себе. Главное, не переборщить.
             3. Зовите кошку той кличкой, к которой она привыкла в приюте. Зовите ее по имени или "кис-кис", 
             подзывая к себе, и угощайте. Если кошка позволяет себя трогать, то поглаживая, приучайте к приятной 
             команде: "Муся хорошая". Даже самая пугливая кошка тянется к человеку.
             Не спугните её доверие.
            """;

    public final static String NECESSARY_DOCUMENTS = """
            Заявление о желании усыновить питомца;
            Паспорт или иной документ удостоверяющий личность;
            Согласие всех членов семьи, которые будут проживать с питомцем;
            """;

    public static String KINOLOG_INFO = """
            Обращайтесь к нашему проверенному кинологу - Петрову Сидору Алексеевичу по номеру 
            555-72-11-2 или пишите в телеграмм @BestKinologEver
            """;

    // Commands
    public final static String COMMAND_START = "/start";
    public final static String COMMAND_STOP_CHAT = "/stopChat";

    // Callbacks
    // Main Menu
    public final static String CALLBACK_MENU_CAT = "cat";
    public final static String CALLBACK_MENU_DOG = "dog";
    public final static String CALLBACK_START_VOLUNTEER_SESSION = "startVolunteerSession";


    // Volunteer Menu
    public final static String CALLBACK_CONTACT_ADOPTER = "contactAdopter";
    public final static String CALLBACK_SEND_ADOPTER_WARNING = "sendAdopterWarning";
    public final static String CALLBACK_CHANGE_PROBATION_TERMS = "changeProbationTerms";
    public final static String CALLBACK_END_VOLUNTEER_SESSION = "endVolunteerSession";

    // Shelter Menu
    public final static String CALLBACK_SHELTER_INFO_MENU = "shelterInfoMenu";
    public final static String CALLBACK_ADOPTION_INFO = "adoptionInfo";
    public final static String CALLBACK_SEND_REPORT_TO_VOLUNTEER = "sendReportToVolunteer";
    public final static String CALLBACK_CALL_VOLUNTEER = "callVolunteer";

    // Shelter Info Menu
    public final static String CALLBACK_SHELTER_INFO = "shelterInfo";
    public final static String CALLBACK_SCHEDULE_ADDRESS = "timetableAndAddress";
    public final static String CALLBACK_SHELTER_ADMISSION = "shelterAdmission";
    public final static String CALLBACK_SAFETY_RULES = "safetyRules";
    public final static String CALLBACK_SAVE_VISITOR_CONTACTS = "saveVisitorContacts";
    public final static String CALLBACK_BACK_TO_CHOOSE_SHELTER = "backToChooseShelter";
    public final static String CALLBACK_BACK_TO_MAIN_MENU = "backToMainMenu";

    // Animal Adoption Menu
    public final static String CALLBACK_HELLO_PET = "helloPetInfo";
    public final static String CALLBACK_NECESSARY_PAPERS = "necessaryPapers";
    public final static String CALLBACK_TRANSPORT_ANIMAL_INFO = "transportAnimalInfo";
    public final static String CALLBACK_KITTEN_HOUSE_INFO = "kittenHouseInfo";
    public final static String CALLBACK_PUPPY_HOUSE_INFO = "puppyHouseInfo";
    public final static String CALLBACK_CAT_HOUSE_INFO = "catHouseInfo";
    public final static String CALLBACK_DOG_HOUSE_INFO = "dogHouseInfo";
    public final static String CALLBACK_DOG_WHISPERER_INFO = "showDogWhispererInfo";
    public final static String CALLBACK_BEST_KINOLOG_INFO = "showBestKinologInfo";
    public final static String CALLBACK_HANDICAPPED_ANIMAL_HOUSE_INFO = "handicappedAnimalHouseInfo";
    public final static String CALLBACK_ADOPTION_REFUSAL_INFO = "adoptionRefusalInfo";


}
