package pro.sky.animalshelter.utils;

public class Constants {
    public static String DOG_SHELTER_DESCRIPTION = """
            Приют "Верный друг" - это дом для бездомных собак, где они получают заботу, 
            любовь и второй шанс на счастливую жизнь. Мы стремимся создать комфортные условия 
            и помочь каждой собаке найти свою идеальную семью.\s
            Услуги и забота: В приюте "Верный друг" каждая собака получает все необходимое. 
            Мы предлагаем регулярное питание, медицинское обслуживание, включая прививки и стерилизацию, 
            а также удобные спальные места и просторные загоны, где собаки могут играть и социализироваться.""";

    public static String CAT_SHELTER_DESCRIPTION = """
            Приют "Лапочка" - это уютное и дружелюбное место для кошек. 
            Мы стремимся обеспечить безопасность, заботу и любовь каждому 
            пушистому питомцу, который попадает к нам.\s
            Услуги и забота: В приюте "Лапочка" каждая кошка получает полный спектр услуг 
            и заботы. Мы предлагаем регулярное питание, медицинское обслуживание, 
            включая вакцинацию и стерилизацию, а также уютные спальные места и 
            игровые комнаты, где кошки могут развлекаться и социализироваться.""";

    public final static String SECURITY_CONTACT_INFO = """
            Данные службы охраны для оформления пропуска на машину:
            \uD83D\uDCDE 3534522
            \uD83D\uDCE7 security@dev.pro
            """;

    public static String SHELTER_SCHEDULE = """
            Наши двери открыты для посещения каждый день с 10.00 до 18.00 без выхожных и праздничных дней!""";

    public static String DOG_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения собак можно приносить только специальные собачьи лакомства.
            Ничего соленого, сладкого, жирного, никаких куриных костей!
            3. Угощать собаку через сетку вольера категорически запрещается!
            4. Перед тем, как взять на прогулку новую (незнакомую) собаку, 
            спросите у волонтеров или работников - можно ли с ней гулять.
            5. Если у вас есть свои домашние питомцы и они случайно заболели (инфекция) пожалуйста, 
            воздержитесь от приезда в приют.
            6. Перед началом проведения каких-либо работ, уточните у руководства общий план дел на сегодня, 
            так называемый фронт работ.
            7. Не заходите без опытных сопровождающих в вольеры с незнакомыми собаками!
            Не все собаки милые и дружелюбные, многие выросли на улице и людям не особо доверяют. 
            Или же они могут быть настолько рады вам, что вы не сумеете совладать с этой радостью.
            8. Если вы собираетесь посетить нас впервые - свяжитесь с опытными волонтерами, 
            вас сопроводят и помогут с адаптацией.
            9. Решив взять с собой ребенка, задумайтесь - готов ли ребенок?
            Многие собаки проявляют искреннюю радость при встрече с детьми. Это сопровождается прыжками, 
            покусыванием, бросанием под ноги. Ребенок может просто не устоять на ногах. 
            И не надо забывать, что собаки чувствуют страх!
            10. По территории приюта передвигайтесь спокойно, не бегайте, не машите руками, говорите спокойно.
            Конечно бывают исключения, когда необходимо крикнуть или разнять дерущихся - но это особый пункт.
            11. Если при вас собаки начали драку - не лезьте голыми руками их разнимать!!!! Сразу зовите на помощь!!! 
            Вам помогут либо опытные волонтеры, либо работники. 
            В крайнем случае, возьмите какой-либо инструмент (лопата, метла) и попробуйте им разнять дерущихся!
            12. При первом посещении не трогайте собак, не смотрите в глаза. Спокойно проходите и занимайтесь делами. 
            Когда собаки с вами познакомятся (обнюхают), тогда можно и погладить. """;

    public static String CAT_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения кошек можно приносить только специальные кошачие лакомства.
            Ничего соленого, сладкого, жирного, никаких рыбных костей!
            """;

    public static String PET_HELLO = """
            1. Посещение приюта: Посетите приют, чтобы ознакомиться с животными и узнать о процессе 
            усыновления. Вы можете задать вопросы персоналу приюта и получить информацию о доступных 
            животных.
                        
            2. Изучение информации: Внимательно прочитайте описание животного, его историю, 
            потребности и характеристики. Также узнайте о медицинском состоянии животного и 
            необходимых процедурах, таких как стерилизация или вакцинация.
                        
            3. Взаимодействие с животным: Если позволяют правила приюта, попросите разрешение на 
            взаимодействие с выбранным животным. Обратите внимание на его поведение, реакцию на вас
            и общую совместимость.
                        
            4. Период адаптации: Перед тем, как забрать животное, уточните, какой план адаптации 
            рекомендуется приютом. Узнайте, как предоставить животному комфорт, безопасность и
            постепенно привыкнуть к новому дому.
                        
            5. Ветеринарный осмотр: После того, как вы решите усыновить животное, обязательно 
            запланируйте посещение ветеринара для осмотра и начала необходимых процедур, таких 
            как вакцинация или чипирование.
            """;

    public static String PET_TRANSPORT = """
            1. Используйте безопасный и комфортабельный контейнер: Подготовьте специальный контейнер 
            или переноску для животного, который обеспечит ему безопасность и комфорт во время 
            перевозки. Убедитесь, что контейнер достаточно прочный, имеет достаточное пространство 
            для животного и хорошую вентиляцию.
                        
            2. Подготовьте контейнер заранее: Установите в контейнер мягкое основание, например, 
            покрывало или полотенце, чтобы животное было комфортно. Положите в контейнер игрушку 
            или предмет, с которым оно знакомо, чтобы сделать процесс более расслабленным.
                        
            3. Предоставьте доступ к воде и пище: Убедитесь, что в контейнере есть миска с пресной 
            водой. Если перевозка займет продолжительное время, убедитесь, что животное получит 
            достаточное количество пищи перед началом путешествия. Однако, учитывайте индивидуальные
             особенности животного и следуйте рекомендациям ветеринара.
                        
            4. Соблюдайте температурные условия: Обеспечьте комфортный климат в транспортном 
            средстве. Избегайте экстремальных температур, как холодных, так и жарких.
                        
            5. Обеспечьте безопасность: Убедитесь, что контейнер надежно закрыт и зафиксирован, 
            чтобы избежать возможности побега животного. Постарайтесь избегать резких движений 
            или вибрации транспортного средства, чтобы снизить стресс у животного.
                        
            6. Имейте при себе необходимые документы: Позаботьтесь о наличии всех необходимых 
            документов, таких как паспорт животного, прививочные сертификаты и другие документы,
            которые могут потребоваться при перевозке.
                        
            7. Постоянно следите за животным: Во время перевозки регулярно проверяйте состояние 
            животного. Обратите внимание на его поведение и физическое состояние. Если возникают
             проблемы или замечаете необычное поведение, обратитесь к ветеринару.
            """;

    public static String REFUSE_POLICY = """
            1. Несоответствие требованиям: Приют может иметь определенные требования для 
            потенциальных владельцев, такие как возраст, жилищные условия, наличие забора 
            вокруг участка и т.д. Если вы не соответствуете этим требованиям, приют может 
            отказать в передаче животного.
                        
            2. Неподходящая совместимость: Приют может проводить проверку совместимости между 
            конкретным животным и потенциальным владельцем. Если они считают, что собака не будет
             счастлива или безопасна в вашем доме или с вашим образом жизни, они могут отказать в 
             передаче.
                        
            3. Неполное оформление документов: Если у вас отсутствуют необходимые документы или 
            вы не предоставили все необходимые информации, приют может отказать в передаче животного 
            до тех пор, пока все не будет правильно оформлено.
                        
            4. Неблагоприятный результат проверки: В некоторых случаях приют может проводить 
            проверку потенциальных владельцев, включая домашнюю проверку или общение с предыдущими 
            работниками или ветеринаром. Если результаты проверки вызывают опасения или 
            подозрения, приют может отказать в передаче животного из соображений безопасности .
                        
            5. Ограниченные ресурсы: В некоторых случаях приют может иметь ограниченные 
            ресурсы, включая количество доступных мест или финансовые возможности. Если приют 
            не может обеспечить достаточное количество ухода и внимания для животного, они могут 
            отказать в передаче.
                        
            Важно помнить, что приюты заботятся о благополучии животных и стремятся найти им 
            надежные и любящие дома. Если у вас отказали в передаче собаки, обратитесь к приюту 
            или специалистам по усыновлению, чтобы получить дополнительную информацию о причинах 
            отказа и возможных вариантах.
            """;

    public static String HOW_TO_HELLO_DOG = """
            1. Будьте спокойны и уверены: Собаки могут чувствовать ваше состояние и эмоции, поэтому 
            важно быть спокойным и уверенным во время общения. Постарайтесь избегать нервозности 
            или напряжения, так как это может вызывать беспокойство у собаки.
                        
            2. Установите правила и границы: Собаки нуждаются в структуре и понимании правил. 
            Установите ясные правила и границы с самого начала, чтобы собака понимала, что можно 
            и нельзя делать. Будьте последовательными и награждайте положительное поведение.
                        
            3. Используйте положительное обучение: Положительное обучение, основанное на поощрении 
            и похвале, является наиболее эффективным способом обучения собак. Используйте 
            вознаграждения в виде лакомств, похвалы и игры для поощрения желаемого поведения.
                        
            4. Установите контакт глазами: Установление контакта глазами с собакой может помочь в
             установлении связи и доверия. Но будьте осторожны, особенно с незнакомыми собаками, 
             и не пристально смотрите в их глаза, так как это может восприниматься как угроза.
                        
            5. Не навязывайте физический контакт: Некоторые собаки могут быть неуверенными или не 
            любить физический контакт с незнакомыми людьми. Уважайте их границы и не навязывайте 
            обнимания или поцелуи. Позвольте им самим подойти к вам и инициировать физическое 
            общение.
                        
            6. Изучайте язык тела собаки: Изучите основные сигналы и язык тела собаки, чтобы лучше 
            понимать ее настроение и потребности. Например, хвост, уши, поза тела и мимика могут 
            дать вам подсказку о том, комфортна ли собака или нет.
                        
            7. Будьте терпеливыми и дайте время: Каждая собака уникальна и может требовать свое 
            время для адаптации и установления доверия. Будьте терпеливыми и дайте собаке время 
            на осмотр и изучение новой среды.
            """;

    public static String KINOLOG_INFO = """
            Обращайтесь к нашему проверенному кинологу - Петрову Сидору Алексеевичу по номеру 
            555-72-11-2 или пишите в телеграмм @BestKinologEver
            """;

    // Commands
    public final static String COMMAND_START = "/start";
    public final static String COMMAND_STOP_CHAT = "/stopChat";

    // Callbacks
    // Main Menu
    public final static String CALLBACK_MENU_CAT = "cat";
    public final static String CALLBACK_MENU_DOG = "dog";
    public final static String CALLBACK_START_VOLUNTEER_SESSION = "startVolunteerSession";


    // Volunteer Menu
    public final static String CALLBACK_CONTACT_ADOPTER = "contactAdopter";
    public final static String CALLBACK_SEND_ADOPTER_WARNING = "sendAdopterWarning";
    public final static String CALLBACK_CHANGE_PROBATION_TERMS = "changeProbationTerms";
    public final static String CALLBACK_END_VOLUNTEER_SESSION = "endVolunteerSession";

    // Shelter Menu
    public final static String CALLBACK_SHELTER_INFO_MENU = "shelterInfoMenu";
    public final static String CALLBACK_ADOPTION_INFO = "adoptionInfo";
    public final static String CALLBACK_SEND_REPORT_TO_VOLUNTEER = "sendReportToVolunteer";
    public final static String CALLBACK_CALL_VOLUNTEER = "callVolunteer";

    // Shelter Info Menu
    public final static String CALLBACK_SHELTER_INFO = "shelterInfo";
    public final static String CALLBACK_SCHEDULE_ADDRESS = "timetableAndAddress";
    public final static String CALLBACK_SHELTER_ADMISSION = "shelterAdmission";
    public final static String CALLBACK_SAFETY_RULES = "safetyRules";
    public final static String CALLBACK_SAVE_VISITOR_CONTACTS = "saveVisitorContacts";
    public final static String CALLBACK_BACK_TO_CHOOSE_SHELTER = "backToChooseShelter";
    public final static String CALLBACK_BACK_TO_MAIN_MENU = "backToMainMenu";

    // Animal Adoption Menu
    public final static String CALLBACK_HELLO_PET = "helloPetInfo";
    public final static String CALLBACK_NECESSARY_PAPERS = "necessaryPapers";
    public final static String CALLBACK_TRANSPORT_ANIMAL_INFO = "transportAnimalInfo";
    public final static String CALLBACK_KITTEN_HOUSE_INFO = "kittenHouseInfo";
    public final static String CALLBACK_CAT_HOUSE_INFO = "catHouseInfo";
    public final static String CALLBACK_DOG_WHISPERER_INFO = "showDogWhispererInfo";
    public final static String CALLBACK_BEST_KINOLOG_INFO = "showBestKinologInfo";
    public final static String CALLBACK_HANDICAPPED_ANIMAL_HOUSE_INFO = "handicappedAnimalHouseInfo";
    public final static String CALLBACK_ADOPTION_REFUSAL_INFO = "adoptionRefusalInfo";



}
