package pro.sky.animalshelter.utils;

public class Constants {
    public static String DOG_SHELTER_DESCRIPTION = """
            Приют "Верный друг" - это дом для бездомных собак, где они получают заботу, 
            любовь и второй шанс на счастливую жизнь. Мы стремимся создать комфортные условия 
            и помочь каждой собаке найти свою идеальную семью.\s
            Услуги и забота: В приюте "Верный друг" каждая собака получает все необходимое. 
            Мы предлагаем регулярное питание, медицинское обслуживание, включая прививки и стерилизацию, 
            а также удобные спальные места и просторные загоны, где собаки могут играть и социализироваться.""";

    public static String CAT_SHELTER_DESCRIPTION = """
            Приют "Лапочка" - это уютное и дружелюбное место для кошек. 
            Мы стремимся обеспечить безопасность, заботу и любовь каждому 
            пушистому питомцу, который попадает к нам.\s
            Услуги и забота: В приюте "Лапочка" каждая кошка получает полный спектр услуг 
            и заботы. Мы предлагаем регулярное питание, медицинское обслуживание, 
            включая вакцинацию и стерилизацию, а также уютные спальные места и 
            игровые комнаты, где кошки могут развлекаться и социализироваться.""";

    public final static String SECURITY_CONTACT_INFO = """
                    Данные службы охраны для оформления пропуска на машину:
                    \uD83D\uDCDE 3534522
                    \uD83D\uDCE7 security@dev.pro
                    """;

    public static String SHELTER_SCHEDULE = """
            Наши двери открыты для посещения каждый день с 10.00 до 18.00 без выхожных и праздничных дней!""";

    public static String DOG_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения собак можно приносить только специальные собачьи лакомства.
            Ничего соленого, сладкого, жирного, никаких куриных костей!
            3. Угощать собаку через сетку вольера категорически запрещается!
            4. Перед тем, как взять на прогулку новую (незнакомую) собаку, 
            спросите у волонтеров или работников - можно ли с ней гулять.
            5. Если у вас есть свои домашние питомцы и они случайно заболели (инфекция) пожалуйста, 
            воздержитесь от приезда в приют.
            6. Перед началом проведения каких-либо работ, уточните у руководства общий план дел на сегодня, 
            так называемый фронт работ.
            7. Не заходите без опытных сопровождающих в вольеры с незнакомыми собаками!
            Не все собаки милые и дружелюбные, многие выросли на улице и людям не особо доверяют. 
            Или же они могут быть настолько рады вам, что вы не сумеете совладать с этой радостью.
            8. Если вы собираетесь посетить нас впервые - свяжитесь с опытными волонтерами, 
            вас сопроводят и помогут с адаптацией.
            9. Решив взять с собой ребенка, задумайтесь - готов ли ребенок?
            Многие собаки проявляют искреннюю радость при встрече с детьми. Это сопровождается прыжками, 
            покусыванием, бросанием под ноги. Ребенок может просто не устоять на ногах. 
            И не надо забывать, что собаки чувствуют страх!
            10. По территории приюта передвигайтесь спокойно, не бегайте, не машите руками, говорите спокойно.
            Конечно бывают исключения, когда необходимо крикнуть или разнять дерущихся - но это особый пункт.
            11. Если при вас собаки начали драку - не лезьте голыми руками их разнимать!!!! Сразу зовите на помощь!!! 
            Вам помогут либо опытные волонтеры, либо работники. 
            В крайнем случае, возьмите какой-либо инструмент (лопата, метла) и попробуйте им разнять дерущихся!
            12. При первом посещении не трогайте собак, не смотрите в глаза. Спокойно проходите и занимайтесь делами. 
            Когда собаки с вами познакомятся (обнюхают), тогда можно и погладить. """;

    public static String CAT_SHELTER_SAFETY = """
            ПРАВИЛА ПОВЕДЕНИЯ НА ТЕРРИТОРИИ ПРИЮТА:
            1. После входа и выхода из вольеров тщательно следить за тем, чтобы двери были хорошо закрыты на щеколду.
            2. Для угощения кошек можно приносить только специальные кошачие лакомства.
            Ничего соленого, сладкого, жирного, никаких рыбных костей!
            """;
}
