package pro.sky.animalshelter.utils;

public class Constants {
    public static String DOG_SHELTER_DESCRIPTION = """
            Приют "Верный друг" - это дом для бездомных собак, где они получают заботу, 
            любовь и второй шанс на счастливую жизнь. Мы стремимся создать комфортные условия 
            и помочь каждой собаке найти свою идеальную семью.\s
            Услуги и забота: В приюте "Верный друг" каждая собака получает все необходимое. 
            Мы предлагаем регулярное питание, медицинское обслуживание, включая прививки и стерилизацию, 
            а также удобные спальные места и просторные загоны, где собаки могут играть и социализироваться.""";

    public static String CAT_SHELTER_DESCRIPTION = """
            Приют "Лапочка" - это уютное и дружелюбное место для кошек. 
            Мы стремимся обеспечить безопасность, заботу и любовь каждому 
            пушистому питомцу, который попадает к нам.\s
            Услуги и забота: В приюте "Лапочка" каждая кошка получает полный спектр услуг 
            и заботы. Мы предлагаем регулярное питание, медицинское обслуживание, 
            включая вакцинацию и стерилизацию, а также уютные спальные места и 
            игровые комнаты, где кошки могут развлекаться и социализироваться.""";

    public final static String SECURITY_CONTACT_INFO = """
                    Данные службы охраны для оформления пропуска на машину:
                    \uD83D\uDCDE 3534522
                    \uD83D\uDCE7 security@dev.pro
                    """;
}
